export const CMD = {
    ADDRESS: '📍 Наш адрес',
    ADMIN: '👩🏼‍💼 Администратор',
    FEEDBACK: '💬 Оставить отзыв',
    INVITE: '🙎‍♂️ Пригласи друга',
    BONUS: '🎁Акции и бонусы',
}

export const FB_BUTTONS = {
    YANDEX: 'Яндекс',
    TWOGIS: '2гис',
    GOOGLE: 'Гугл',
    ANONIM: 'Анонимно',
}

export const STOCKS = {
    INVITE_FR: '🤝🏻 Пригласи друга',
    PAIR_HAIR: '💇🏼💇🏽Парная стрижка',
    BONUS_REVIEWS: '💰 Бонусы за отзывы',
    BONUS_REFERENCES: '📸 Бонусы за упоминания',
}

export const LARGE_TEXT = {
    FRIENDS: `Пригласи друга и получи бонусные рубли на счет 💸
❗️Учитываются новые клиенты, которые ранее не пользовались нашими услугами. Бонусы зачисляются на ваш счет в момент предоставления приглашенным реферального кода администратору❗️

Сколько начисляем?
1-2 друга - 100 бонусов за каждого 
3-5 друзей - 150 бонусов за каждого
От 5 и выше - 200 бонусов за каждого`,

    DOUBLE_HAIR: `Приходи с любыми людьми (будь то друг, брат, сын, отец и тд) на стрижку в ОДИН ДЕНЬ, не важно идёте ли Вы к одному мастеру или разным, также можно записаться в любое рабочее время. 
Предложение распространяется на количество человек от двух и выше. 
❗️Главное условие❗️ -  одна дата стрижки🗓 
Получите скидку 200₽ на каждую оказанную услугу💸`,

    GIFT_REVIEWS: `Оставь его в любых сетях: 2ГИС, Яндекс Карты, Yclients ✍🏻
Просто покажите отзывы нашему администратору, он зафиксирует скидку 100 бонусов за каждый отзыв💸`,

    GIFT_REFERENCES: `Также в социальных сетях с отметкой нашего барбершопа: ВКонтакте, Инстаграм, Телеграм.✍🏻
Мы также отреагируем на отметку и свяжемся с вами в этот день для того, чтобы зафиксировать за Вами скидку💸
За каждую отметку начисляем 50 бонусных рублей💰`,
}
