export const getStartMessage = (name) => {
    return `Привет, ${name}!

На связи <b>Барбершоп "Формула"</b>💈 — Формула твоего успеха и индивидуального образа 💇🏼
Здесь ты можешь записаться к любимому мастеру, копить бонусы, получать напоминания и многое другое.

Приглашай друзей и получай скидку 🎁
Подписывайся на соцсети, чтобы быть в курсе событий:
<a href="https://vk.com/formulabarbershop">ВКонтакте</a>, <a href="https://www.instagram.com/formula_barbershop">Инстаграм</a>, <a href="https://t.me/formulabarber">Телеграм</a>`
}
