export const getStartMessage = (name) => {
    return `Привет, ${name}!

На связи <b>Барбершоп "Формула"</b>💈 — Формула твоего успеха и индивидуального образа 💇🏼
Здесь ты можешь записаться к любимому мастеру, копить бонусы, получать напоминания и многое другое.

Приглашай друзей и получай бонусные рубли 🎁
Подписывайся на соцсети, чтобы быть в курсе событий:
<a href="https://vk.com/formulabarbershop">ВКонтакте</a>, <a href="https://www.instagram.com/formula_barbershop">Инстаграм</a>, <a href="https://t.me/formulabarber">Телеграм</a>`
}

export const getContactMessage = (name) => {
    return `${name}, приветствуем тебя в Формуле! 👋
Для корректной работы бота поделись с нами контактом ⬇️`
}

export const getContactPleasureMessage = () => {
    return `Спасибо, что выбрал нас!🔥

Теперь тебе доступны все возможности бота:
• Онлайн-запись к мастеру
• Автоматические напоминания
• Накопительная бонусная система

<blockquote>Узнать баланс бонусов можно по соответствующей кнопке внизу</blockquote>
`
}

export const getAdminMessage = () => {
    return `По вопросам работы барбершопа
обращайтесь в аккаунт 👤 <a href="https://t.me/formula_barber">formula_barber</a> 
или по номеру 📞 +7(908)554-14-14`
}
